ERP.belugaerp/src/DataProcessors/ПанельОбменЕГАИС/ПанельОбменЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПанельОбменЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

ERP.belugaerp/src/Documents/битЗаявлениеОВыдачеФСМ/битЗаявлениеОВыдачеФСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битЗаявлениеОВыдачеФСМ</name>
  <comment>Заявление о выдаче ФСМ</comment>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриториальныйОрганРАР</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявления</name>
    <type>
      <types>EnumRef.бг_ТипыЗаявленийОВыдачеФСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битНакладнаяНаВыдачуФСМ/битНакладнаяНаВыдачуФСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битНакладнаяНаВыдачуФСМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>NUMBER</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>Date</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <comment>Sender</comment>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <comment>Consignee</comment>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявлениеОВыдачеФСМ</name>
    <type>
      <types>DocumentRef.битЗаявлениеОВыдачеФСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПроизводителяМарок</name>
    <comment>ManufacturerShortName</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическойОтгрузки</name>
    <comment>ActualShipmentDate</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМарки</name>
      <type>
        <types>CatalogRef.бг_КлассификаторТиповМарок</types>
      </type>
    </attributes>
    <attributes>
      <name>бг_СерияМарки</name>
      <comment>Rank</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_НомерРулона</name>
      <comment>RollNumber</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_НомерДиапазонаВРулоне</name>
      <comment>RangeNumberInRoll</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_НачальныйНомерДиапазона</name>
      <comment>Start</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>бг_КонечныйНомерДиапазона</name>
      <comment>Last</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМарок</name>
      <comment>QuantityRange</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битАктОбУничтоженииФСМ/битАктОбУничтоженииФСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битАктОбУничтоженииФСМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <comment>ОрганизацияЕГАИС</comment>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявлениеОВыдачеФСМ</name>
    <type>
      <types>DocumentRef.битЗаявлениеОВыдачеФСМ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Марки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальныйНомерПоддиапазона</name>
      <comment>Start</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечныйНомерПоддиапазона</name>
      <comment>Last</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМарок</name>
      <comment>QuantityRange</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаУничтожения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Списания</name>
    <attributes>
      <name>Списание</name>
      <type>
        <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битДобавлениеНовойПродукцииЕГАИС/битДобавлениеНовойПродукцииЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битДобавлениеНовойПродукцииЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <comment>Importer</comment>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйКодФРАП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрепостьМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрепостьМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипыПродукцииЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ERP.belugaerp/src/Documents/битПланируемыйВвозЕГАИС/битПланируемыйВвозЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битПланируемыйВвозЕГАИС</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <comment>Импортер</comment>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПост</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ERP.belugaerp/src/DataProcessors/ПанельОбменЕГАИС/Forms/Форма/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура бг_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
    бг_ДобавитьГруппыДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура бг_ОткрытьбитЗаявлениеОВыдачеФСМ(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битЗаявлениеОВыдачеФСМ.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитЗаявлениеОВыдачеФСМОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битЗаявлениеОВыдачеФСМ.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитЗаявлениеОВыдачеФСМОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битЗаявлениеОВыдачеФСМ.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитНакладнаяНаВыдачуФСМ(Команда)
	
	ОткрытьФормуСпискаДокументов("Документ.битНакладнаяНаВыдачуФСМ.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитАктОбУничтоженииФСМ(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битАктОбУничтоженииФСМ.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитАктОбУничтоженииФСМОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битАктОбУничтоженииФСМ.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитАктОбУничтоженииФСМОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битАктОбУничтоженииФСМ.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитДобавлениеНовойПродукцииЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов("Документ.битДобавлениеНовойПродукцииЕГАИС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитДобавлениеНовойПродукцииЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битДобавлениеНовойПродукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитДобавлениеНовойПродукцииЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битДобавлениеНовойПродукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитПланируемыйВвозЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов("Документ.битПланируемыйВвозЕГАИС.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитПланируемыйВвозЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битПланируемыйВвозЕГАИС.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитПланируемыйВвозЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битПланируемыйВвозЕГАИС.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОбИмпортеПродукцииЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОбИмпортеПродукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОбИмпортеПродукцииЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОбИмпортеПродукцииЕГАИС.ФормаСписка",
		Неопределено, Истина);

КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОбИмпортеПродукцииЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОбИмпортеПродукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОбИмпортеПродукцииЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОбИмпортеПродукцииЕГАИС.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОПроизводствеЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОПроизводствеЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОПроизводствеЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОПроизводствеЕГАИС.ФормаСписка",
		Неопределено, Истина);

КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОПроизводствеЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОПроизводствеЕГАИС.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитОтчетОПроизводствеЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битОтчетОПроизводствеЕГАИС.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.ФормаСписка",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.ФормаСписка",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура бг_ОткрытьбитУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС.ФормаСписка",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ОбновитьСпискиДокументовЕГАИС")
Процедура бг_ОбновитьСпискиДокументовЕГАИС()
	
#Вставка
	УстановитьПривилегированныйРежим(Истина);
#КонецВставки
	
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Метаданные");
	ТаблицаДокументы.Колонки.Добавить("Заголовок");
	ТаблицаДокументы.Колонки.Добавить("Оформите");
	ТаблицаДокументы.Колонки.Добавить("Отработайте");
	ТаблицаДокументы.Колонки.Добавить("Ожидайте");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоЧтение");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоДобавление");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоРедактирование");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНВходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные ЕГАИС (входящие)';
			|en = 'Товарно-транспортные накладные ЕГАИС (входящие)'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНИсходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные ЕГАИС (исходящие)';
			|en = 'Товарно-транспортные накладные ЕГАИС (исходящие)'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТранспортнаяНакладнаяЕГАИС,
		НСтр("ru = 'Транспортные накладные ЕГАИС';
			|en = 'Транспортные накладные ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктПостановкиНаБалансЕГАИС,
		НСтр("ru = 'Акты постановки на баланс ЕГАИС';
			|en = 'Акты постановки на баланс ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктСписанияЕГАИС,
		НСтр("ru = 'Акты списания ЕГАИС';
			|en = 'Акты списания ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ПередачаВРегистр2ЕГАИС,
		НСтр("ru = 'Передачи в регистр №2 ЕГАИС';
			|en = 'Передачи в регистр №2 ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ВозвратИзРегистра2ЕГАИС,
		НСтр("ru = 'Возвраты из регистра №2 ЕГАИС';
			|en = 'Возвраты из регистра №2 ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОстаткиЕГАИС,
		НСтр("ru = 'Остатки ЕГАИС';
			|en = 'Остатки ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетЕГАИС,
		НСтр("ru = 'Отчеты ЕГАИС';
			|en = 'Отчеты ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС,
		НСтр("ru = 'Запросы акцизных марок ЕГАИС';
			|en = 'Запросы акцизных марок ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
#Вставка		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битЗаявлениеОВыдачеФСМ,
		Метаданные.Документы.битЗаявлениеОВыдачеФСМ.ПредставлениеСписка,
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битНакладнаяНаВыдачуФСМ,
		Метаданные.Документы.битНакладнаяНаВыдачуФСМ.ПредставлениеСписка,
		Ложь,  // Оформите
		Ложь,  // Отработайте
		Ложь); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битАктОбУничтоженииФСМ,
		Метаданные.Документы.битАктОбУничтоженииФСМ.ПредставлениеСписка,
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битДобавлениеНовойПродукцииЕГАИС,
		Метаданные.Документы.битДобавлениеНовойПродукцииЕГАИС.ПредставлениеСписка,
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битПланируемыйВвозЕГАИС,
		Метаданные.Документы.битПланируемыйВвозЕГАИС.ПредставлениеСписка,
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битОтчетОбИмпортеПродукцииЕГАИС,
		Метаданные.Документы.битОтчетОбИмпортеПродукцииЕГАИС.ПредставлениеСписка,
		Истина,  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битОтчетОПроизводствеЕГАИС,
		Метаданные.Документы.битОтчетОПроизводствеЕГАИС.ПредставлениеСписка,
		Истина,  // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
		
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС,
		НСтр("ru = 'Уведомления о начале оборота АП';
			|en = 'Уведомления о начале оборота АП'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
#КонецВставки
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИС,
		НСтр("ru = 'Чеки ЕГАИС';
			|en = 'Чеки ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИСВозврат,
		НСтр("ru = 'Чеки ЕГАИС на возврат';
			|en = 'Чеки ЕГАИС на возврат'"),
		Истина, Истина, Истина);
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ВсеТребующиеОжидания = Новый Массив;
	ВсеТребующиеДействия = Новый Массив;
	
	Для Каждого ТекЭлемент Из ТаблицаДокументы Цикл
		
		Если Не ТекЭлемент.ЕстьПравоЧтение Тогда
			Элементы["Группа" + ТекЭлемент.Метаданные.Имя].Видимость = Ложь;
			Продолжить;
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТекЭлемент.Метаданные.ПолноеИмя());
		
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеОжидания() Цикл
			Если ВсеТребующиеОжидания.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеОжидания.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеДействия() Цикл
			Если ВсеТребующиеДействия.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеДействия.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		
		Если ТекЭлемент.Оформите И ТекЭлемент.ЕстьПравоДобавление Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОформите(),
				ТекЭлемент.Метаданные.Имя + "Оформите");
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте И ТекЭлемент.ЕстьПравоРедактирование Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОтработайте(),
				ТекЭлемент.Метаданные.Имя + "Отработайте");
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОжидайте(),
				ТекЭлемент.Метаданные.Имя + "Ожидайте");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ОрганизацияЕГАИС",            ОрганизацииЕГАИС);
	ПараметрыЗапроса.Вставить("БезОтбораПоОрганизацииЕГАИС", ОрганизацииЕГАИС.Количество() = 0);
	ПараметрыЗапроса.Вставить("Ответственный",        ?(ЗначениеЗаполнено(Ответственный), Ответственный,    Неопределено));
	ПараметрыЗапроса.Вставить("ВсеТребующиеОжидания", ВсеТребующиеОжидания);
	ПараметрыЗапроса.Вставить("ВсеТребующиеДействия", ВсеТребующиеДействия);
	
	Запрос = Новый Запрос;
	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
	
	Для ТекИндекс = 0 По ТаблицаДокументы.Количество() - 1 Цикл
		
		ТекЭлемент = ТаблицаДокументы[ТекИндекс];
		ИмяДокумента = ТекЭлемент.Метаданные.Имя;
		
		Если НЕ ТекЭлемент.ЕстьПравоЧтение Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщееКоличество  = 0;
		ТоваровКПередаче = 0;
		
		ЕстьПередачаВРегистр2ЕГАИС = Ложь;
		
		Если ТекЭлемент.Оформите Тогда
			КнопкаОформите = Элементы["Открыть" + ИмяДокумента + "Оформите"];
			ПустаяОформите = Элементы["Открыть" + ИмяДокумента + "ОформитеДекорация"];
			ТекстОформите  = НСтр("ru = 'оформите';
									|en = 'оформите'");
			
			Если ТекЭлемент.ЕстьПравоДобавление Тогда
				Если ТекЭлемент.Метаданные = Метаданные.Документы.ПередачаВРегистр2ЕГАИС Тогда
					
					ЕстьПередачаВРегистр2ЕГАИС = Истина;
					ТоваровКПередаче = ВывестиПоказатель(
						РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать(), КнопкаОформите, ТекстОформите, Истина);
					
				ИначеЕсли ТекЭлемент.Метаданные = Метаданные.Документы.АктПостановкиНаБалансЕГАИС Тогда
					
					Выборка = РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать();
					КоличествоДокументов = ?(Выборка.Следующий(), Выборка.КоличествоДокументов, 0);
					
					Если Цел(КоличествоДокументов) > 0 Тогда
						ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(Цел(КоличествоДокументов), КнопкаОформите, ТекстОформите);
					ИначеЕсли КоличествоДокументов > 0 Тогда
						ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(1, КнопкаОформите, ТекстОформите, Истина);
					Иначе
						ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(0, КнопкаОформите, ТекстОформите);
					КонецЕсли;
				
				Иначе
					
					ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(
					РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать(), КнопкаОформите, ТекстОформите);
					
				КонецЕсли;
				
				ПустаяОформите.Видимость = Ложь;
			Иначе
				КнопкаОформите.Видимость = Ложь;
				ПустаяОформите.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте Тогда
			КнопкаОтработайте = Элементы["Открыть" + ИмяДокумента + "Отработайте"];
			ПустаяОтработайте = Элементы["Открыть" + ИмяДокумента + "ОтработайтеДекорация"];
			ТекстОтработайте  = НСтр("ru = 'отработайте';
									|en = 'отработайте'");
			
			Если ТекЭлемент.ЕстьПравоРедактирование Тогда
				ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(
					РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Отработайте"].Выбрать(), КнопкаОтработайте, ТекстОтработайте);
				
				ПустаяОтработайте.Видимость = Ложь;
			Иначе
				КнопкаОтработайте.Видимость = Ложь;
				ПустаяОтработайте.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			КнопкаОжидайте = Элементы["Открыть" + ИмяДокумента + "Ожидайте"];
			ТекстОжидайте  = НСтр("ru = 'ожидайте';
									|en = 'ожидайте'");
			
			ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(
				РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Ожидайте"].Выбрать(), КнопкаОжидайте, ТекстОжидайте);
		КонецЕсли;
		
		Если ЕстьПередачаВРегистр2ЕГАИС И ОбщееКоличество = 0 И ТоваровКПередаче > 0 Тогда
			ВывестиПоказатель(
				1,
				Элементы["Открыть" + ИмяДокумента],
				ТекЭлемент.Заголовок, Истина);
		Иначе
			ВывестиПоказатель(
				ОбщееКоличество,
				Элементы["Открыть" + ИмяДокумента],
				ТекЭлемент.Заголовок);
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьГруппыДокументов()

	// Закупки 
	бг_ДобавитьЭлементыПоДокументу("битЗаявлениеОВыдачеФСМ", Элементы.ГруппаЗакупки, Ложь, Истина, Истина);
	бг_ДобавитьЭлементыПоДокументу("битНакладнаяНаВыдачуФСМ", Элементы.ГруппаЗакупки, Ложь, Ложь, Ложь);
	бг_ДобавитьЭлементыПоДокументу("битАктОбУничтоженииФСМ", Элементы.ГруппаЗакупки, Ложь, Истина, Истина);
	бг_ДобавитьЭлементыПоДокументу("битДобавлениеНовойПродукцииЕГАИС", Элементы.ГруппаЗакупки, Ложь, Истина, Истина);
	бг_ДобавитьЭлементыПоДокументу("битПланируемыйВвозЕГАИС", Элементы.ГруппаЗакупки, Ложь, Истина, Истина);
	бг_ДобавитьЭлементыПоДокументу("битОтчетОбИмпортеПродукцииЕГАИС", Элементы.ГруппаЗакупки, Истина, Истина, Истина);
	
	// Производство
	бг_ДобавитьРазделПроизводство();
	бг_ДобавитьЭлементыПоДокументу(
		"битОтчетОПроизводствеЕГАИС",
		Элементы["бг_ГруппаДокументыПроизводства"],
		Истина,
		Истина,
		Истина);
	
	бг_ДобавитьЭлементыПоДокументу(
		"битУведомлениеОНачалеОборотаНаТерриторииРФАПЕГАИС",
		Элементы["бг_ГруппаДокументыПроизводства"],
		Ложь,
		Истина,
		Истина);
		
КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьРазделПроизводство()

	КонтекстГруппы = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(
		ЭтаФорма, 
		Элементы.Документы, 
		Элементы.ГруппаПродажи,
		бг_СвойстваВертикальнойГруппы());
		
	ГруппаДокументыПроизводства = бг_ПрограммныйИнтерфейс.НоваяГруппаФормы(
		КонтекстГруппы, 
		"бг_ГруппаДокументыПроизводства", 
		"Производство");

КонецПроцедуры

&НаСервере
Процедура бг_ДобавитьЭлементыПоДокументу(ИмяДокумента, Родитель, Оформите, Отработайте, Ожидайте)

	КонтекстОсновнойГруппы = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(
		ЭтаФорма, 
		Родитель, 
		, // РасположитьПередЭлементом
		бг_СвойстваГоризонтальнойГруппыБезОтображения());
		
	ОсновнаяГруппа = бг_ПрограммныйИнтерфейс.НоваяГруппаФормы(
		КонтекстОсновнойГруппы, 
		"бг_Группа" + ИмяДокумента, 
		Метаданные.Документы[ИмяДокумента].ПредставлениеСписка);
	ОсновнаяГруппа.Высота = 1;	
	ОсновнаяГруппа.РастягиватьПоГоризонтали = Ложь;
	ОсновнаяГруппа.РастягиватьПоВертикали = Ложь;
		
	КонтекстВложеннойГруппы = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(
		ЭтаФорма, 
		ОсновнаяГруппа,,
		бг_СвойстваГоризонтальнойГруппыБезОтображения());
			
	// Заголовок	
	ГруппаЗаголовок = бг_ПрограммныйИнтерфейс.НоваяГруппаФормы(
		КонтекстВложеннойГруппы, 
		"бг_Группа" + ИмяДокумента + "Заголовок", 
		НСтр("ru = 'Заголовок'"));
	ГруппаЗаголовок.Высота = 1;	
	ГруппаЗаголовок.Ширина = 40;
	ГруппаЗаголовок.РастягиватьПоГоризонтали = Ложь;
	ГруппаЗаголовок.РастягиватьПоВертикали = Ложь;
	
	КонтекстГиперссылки = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(ЭтаФорма, ГруппаЗаголовок);
	Гиперссылка = бг_ПрограммныйИнтерфейс.НоваяКомандаИГиперссылкаФормы(
		КонтекстГиперссылки,
		"Открыть" + ИмяДокумента, 
		"бг_Открыть" + ИмяДокумента,
		Метаданные.Документы[ИмяДокумента].ПредставлениеСписка); 
	Гиперссылка.Высота = 1;	
	Гиперссылка.Шрифт = Новый Шрифт(,, Истина); // Полужирный
	Гиперссылка.РастягиватьПоГоризонтали = Ложь;
	Гиперссылка.РастягиватьПоВертикали = Ложь;
		
	// Оформите	
	ГруппаОформите = бг_ПрограммныйИнтерфейс.НоваяГруппаФормы(
		КонтекстВложеннойГруппы, 
		"бг_Группа" + ИмяДокумента + "Оформите", 
		НСтр("ru = 'Оформите'"));
	ГруппаОформите.Высота = 1;
	ГруппаОформите.Ширина = 12;
	ГруппаОформите.РастягиватьПоГоризонтали = Ложь;
	ГруппаОформите.РастягиватьПоВертикали = Ложь;
		
	КонтекстДекорации = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(ЭтаФорма, ГруппаОформите);
	Декорация = бг_НоваяДекорацияФормы(КонтекстДекорации, "Открыть" + ИмяДокумента + "ОформитеДекорация");
	Декорация.Заголовок = НСтр("ru = 'Декорация'");
	Декорация.Вид = ВидДекорацииФормы.Картинка;
	Декорация.Высота = 1;
	Декорация.РастягиватьПоГоризонтали = Ложь;
	Декорация.РастягиватьПоВертикали = Ложь;
	
	Если Оформите Тогда
		КонтекстГиперссылки = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(ЭтаФорма, ГруппаОформите);
		Гиперссылка = бг_ПрограммныйИнтерфейс.НоваяКомандаИГиперссылкаФормы(
			КонтекстГиперссылки,
			"Открыть" + ИмяДокумента + "Оформите", 
			"бг_Открыть" + ИмяДокумента + "Оформите",
			НСтр("ru = 'оформите'"));
		Гиперссылка.Высота = 1;
		Гиперссылка.РастягиватьПоГоризонтали = Ложь;
		Гиперссылка.РастягиватьПоВертикали = Ложь;
	КонецЕсли;
	
	// Отработайте
	ГруппаОтработайте = бг_ПрограммныйИнтерфейс.НоваяГруппаФормы(
		КонтекстВложеннойГруппы, 
		"бг_Группа" + ИмяДокумента + "Отработайте", 
		НСтр("ru = 'Отработайте'"));
	ГруппаОтработайте.Высота = 1;
	ГруппаОтработайте.Ширина = 12;
	ГруппаОтработайте.РастягиватьПоГоризонтали = Ложь;
	ГруппаОтработайте.РастягиватьПоВертикали = Ложь;
	
	КонтекстДекорации = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(ЭтаФорма, ГруппаОтработайте);
	Декорация = бг_НоваяДекорацияФормы(КонтекстДекорации, "Открыть" + ИмяДокумента + "ОтработайтеДекорация");
	Декорация.Заголовок = НСтр("ru = 'Декорация'");
	Декорация.Вид = ВидДекорацииФормы.Картинка;
	Декорация.Высота = 1;
	Декорация.РастягиватьПоГоризонтали = Ложь;
	Декорация.РастягиватьПоВертикали = Ложь;
	
	Если Отработайте Тогда
		КонтекстГиперссылки = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(ЭтаФорма, ГруппаОтработайте);
		Гиперссылка = бг_ПрограммныйИнтерфейс.НоваяКомандаИГиперссылкаФормы(
			КонтекстГиперссылки,
			"Открыть" + ИмяДокумента + "Отработайте", 
			"бг_Открыть" + ИмяДокумента + "Отработайте",
			НСтр("ru = 'отработайте'"));
		Гиперссылка.Высота = 1;
		Гиперссылка.РастягиватьПоГоризонтали = Ложь;
		Гиперссылка.РастягиватьПоВертикали = Ложь;
	КонецЕсли;
		
	// Ожидайте
	ГруппаОжидайте = бг_ПрограммныйИнтерфейс.НоваяГруппаФормы(КонтекстВложеннойГруппы, 
		"бг_Группа" + ИмяДокумента + "Ожидайте", 
		НСтр("ru = 'Ожидайте'"));
	ГруппаОжидайте.Высота = 1;
	ГруппаОжидайте.Ширина = 12;
	ГруппаОжидайте.РастягиватьПоГоризонтали = Ложь;
	
	Если Ожидайте Тогда
		КонтекстГиперссылки = бг_ПрограммныйИнтерфейс.НовыйКонтекстЭлемента(ЭтаФорма, ГруппаОжидайте);
		Гиперссылка = бг_ПрограммныйИнтерфейс.НоваяКомандаИГиперссылкаФормы(
			КонтекстГиперссылки,
			"Открыть" + ИмяДокумента + "Ожидайте", 
			"бг_Открыть" + ИмяДокумента + "Ожидайте",
			НСтр("ru = 'ожидайте'"));
		Гиперссылка.Высота = 1;
		Гиперссылка.РастягиватьПоГоризонтали = Ложь;
		Гиперссылка.РастягиватьПоВертикали = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция бг_СвойстваГоризонтальнойГруппыБезОтображения()
	
	Свойства = Новый Структура;
	
	Свойства.Вставить("Вид",                 ВидГруппыФормы.ОбычнаяГруппа);
	Свойства.Вставить("Отображение",         ОтображениеОбычнойГруппы.Нет);
	Свойства.Вставить("ОтображатьЗаголовок", Ложь);
	
	Возврат Свойства;
	
КонецФункции

&НаСервере
Функция бг_СвойстваВертикальнойГруппы()
	
	Свойства = Новый Структура;
	Свойства.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
	Свойства.Вставить("Отображение", ОтображениеОбычнойГруппы.ОбычноеВыделение);
	Свойства.Вставить("ОтображатьЗаголовок", Истина);
	Свойства.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	Свойства.Вставить("Объединенная", Истина);
	
	Возврат Свойства;
	
КонецФункции

&НаСервере
Функция бг_НоваяДекорацияФормы(КонтекстЭлемента, ИмяПоля) Экспорт

	Форма = КонтекстЭлемента.Форма;
	Родитель = КонтекстЭлемента.Родитель;
	Свойства = КонтекстЭлемента.Свойства;
	
	ДекорацияФормы = Форма.Элементы.Добавить(ИмяПоля, Тип("ДекорацияФормы"), Родитель);

	ЗаполнитьЗначенияСвойств(ДекорацияФормы, Свойства);	
	
	Возврат ДекорацияФормы;
	
КонецФункции

#КонецОбласти
